// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль


// let arrNum=[1,2,3,4,5]
// let arrStr=['ww','ee','rr','tt','ff']
// let arrMix=[1,'ee','rr',true, false]
// console.log(arrNum, arrStr, arrMix)



// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу.
// Вивести в консоль

// let arrAdd=[];
//     arrAdd[0]=1;
//     arrAdd[1]= 'true';
//     arrAdd[2]='rrrr'
// console.log(arrAdd)

// - є масив [2,17,13,6,22,31,45,66,100,-18] :
// 1. перебрати його циклом while

// let arr1=[2,17,13,6,22,31,45,66,100,-18]
// let i1=0;
// while (i1<arr1.length){
//     console.log(arr1[i1])
//     i1++;
// }

//     2. перебрати його циклом for

// let arr1=[2,17,13,6,22,31,45,66,100,-18]
// for (i=0; i<arr1.length; i++){
//     console.log(arr1[i])
// }


//     3. перебрати циклом while та вивести  числа тільки з непарним індексом

// let arr1=[2,17,13,6,22,31,45,66,100,-18]
// let i=1;
//     while (i<arr1.length){
//         console.log(arr1[i]);
//         i+=2;
//     }



// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// let arr1=[2,3,13,6,22,31,45,66,100,-18]
// for (i=1; i<arr1.length; i+=2){
//     console.log(arr1[i])
// }

// 5. перебрати циклом while та вивести  числа тільки парні  значення

// let arr1=[2,3,13,6,22,31,45,66,100,-18];
// let i=0;
// while (i<arr1.length){
//     if (arr1[i]%2===0){
//     console.log(arr1[i])
//     }
//     i++;
// }


// 6. перебрати циклом for та вивести  числа тільки парні  значення

// let arr1=[2,3,13,6,22,31,45,66,100,-18];
// for (i=0; i<arr1.length; i++) {
//     if (arr1[i]%2===0){
//         console.log(arr1[i])
//     }
// }

// 7. замінити кожне число кратне 3 на слово "okten"

// let arr1=[2,3,13,6,22,31,45,66,100,-18];
// for (i=0; i<arr1.length; i++){
// if (arr1[i]%3===0){
//             arr1[i]="okten";
//      }
// }
// console.log(arr1)

// 8. вивести масив в зворотньому порядку.

let arr1=[2,3,13,6,22,31,45,66,100,-18];
for (i=arr1.length; i>0; i--){
    arr1[i]=arr1[arr1.length];
}
console.log(arr1)

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор